Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_plc_and_go/firmware/src/packs/PIC32CX2051MTG128_DFP/component/supc.h
#define SUPC_WUIR_WKUPT9_LOW                  (SUPC_WUIR_WKUPT9_LOW_Val << SUPC_WUIR_WKUPT9_Pos)   /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT9_HIGH                 (SUPC_WUIR_WKUPT9_HIGH_Val << SUPC_WUIR_WKUPT9_Pos)  /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT10_Pos                 _UINT32_(26)                                         /* (SUPC_WUIR) Wake-up Input Type 10 Position */
#define SUPC_WUIR_WKUPT10_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPT10_Pos)             /* (SUPC_WUIR) Wake-up Input Type 10 Mask */
#define SUPC_WUIR_WKUPT10(value)              (SUPC_WUIR_WKUPT10_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT10_Pos)) /* Assigment of value for WKUPT10 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT10_LOW_Val           _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT10_HIGH_Val          _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT10_LOW                 (SUPC_WUIR_WKUPT10_LOW_Val << SUPC_WUIR_WKUPT10_Pos) /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT10_HIGH                (SUPC_WUIR_WKUPT10_HIGH_Val << SUPC_WUIR_WKUPT10_Pos) /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT11_Pos                 _UINT32_(27)                                         /* (SUPC_WUIR) Wake-up Input Type 11 Position */
#define SUPC_WUIR_WKUPT11_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPT11_Pos)             /* (SUPC_WUIR) Wake-up Input Type 11 Mask */
#define SUPC_WUIR_WKUPT11(value)              (SUPC_WUIR_WKUPT11_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT11_Pos)) /* Assigment of value for WKUPT11 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT11_LOW_Val           _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT11_HIGH_Val          _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT11_LOW                 (SUPC_WUIR_WKUPT11_LOW_Val << SUPC_WUIR_WKUPT11_Pos) /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT11_HIGH                (SUPC_WUIR_WKUPT11_HIGH_Val << SUPC_WUIR_WKUPT11_Pos) /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT12_Pos                 _UINT32_(28)                                         /* (SUPC_WUIR) Wake-up Input Type 12 Position */
#define SUPC_WUIR_WKUPT12_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPT12_Pos)             /* (SUPC_WUIR) Wake-up Input Type 12 Mask */
#define SUPC_WUIR_WKUPT12(value)              (SUPC_WUIR_WKUPT12_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT12_Pos)) /* Assigment of value for WKUPT12 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT12_LOW_Val           _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT12_HIGH_Val          _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT12_LOW                 (SUPC_WUIR_WKUPT12_LOW_Val << SUPC_WUIR_WKUPT12_Pos) /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT12_HIGH                (SUPC_WUIR_WKUPT12_HIGH_Val << SUPC_WUIR_WKUPT12_Pos) /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT13_Pos                 _UINT32_(29)                                         /* (SUPC_WUIR) Wake-up Input Type 13 Position */
#define SUPC_WUIR_WKUPT13_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPT13_Pos)             /* (SUPC_WUIR) Wake-up Input Type 13 Mask */
#define SUPC_WUIR_WKUPT13(value)              (SUPC_WUIR_WKUPT13_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT13_Pos)) /* Assigment of value for WKUPT13 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT13_LOW_Val           _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT13_HIGH_Val          _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT13_LOW                 (SUPC_WUIR_WKUPT13_LOW_Val << SUPC_WUIR_WKUPT13_Pos) /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT13_HIGH                (SUPC_WUIR_WKUPT13_HIGH_Val << SUPC_WUIR_WKUPT13_Pos) /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT14_Pos                 _UINT32_(30)                                         /* (SUPC_WUIR) Wake-up Input Type 14 Position */
#define SUPC_WUIR_WKUPT14_Msk                 (_UINT32_(0x1) << SUPC_WUIR_WKUPT14_Pos)             /* (SUPC_WUIR) Wake-up Input Type 14 Mask */
#define SUPC_WUIR_WKUPT14(value)              (SUPC_WUIR_WKUPT14_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT14_Pos)) /* Assigment of value for WKUPT14 in the SUPC_WUIR register */
#define   SUPC_WUIR_WKUPT14_LOW_Val           _UINT32_(0x0)                                        /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define   SUPC_WUIR_WKUPT14_HIGH_Val          _UINT32_(0x1)                                        /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply.  */
#define SUPC_WUIR_WKUPT14_LOW                 (SUPC_WUIR_WKUPT14_LOW_Val << SUPC_WUIR_WKUPT14_Pos) /* (SUPC_WUIR) A falling edge followed by a low level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_WKUPT14_HIGH                (SUPC_WUIR_WKUPT14_HIGH_Val << SUPC_WUIR_WKUPT14_Pos) /* (SUPC_WUIR) A rising edge followed by a high level for a period defined by WKUPDBC on the corresponding wake-up input forces the wake-up of the core power supply. Position  */
#define SUPC_WUIR_Msk                         _UINT32_(0x7FFF7FFF)                                 /* (SUPC_WUIR) Register Mask  */

#define SUPC_WUIR_WKUPEN_Pos                  _UINT32_(0)                                          /* (SUPC_WUIR Position) Wake-up Input Enable x */
#define SUPC_WUIR_WKUPEN_Msk                  (_UINT32_(0x7FFF) << SUPC_WUIR_WKUPEN_Pos)           /* (SUPC_WUIR Mask) WKUPEN */
#define SUPC_WUIR_WKUPEN(value)               (SUPC_WUIR_WKUPEN_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPEN_Pos)) 
#define SUPC_WUIR_WKUPT_Pos                   _UINT32_(16)                                         /* (SUPC_WUIR Position) Wake-up Input Type x4 */
#define SUPC_WUIR_WKUPT_Msk                   (_UINT32_(0x7FFF) << SUPC_WUIR_WKUPT_Pos)            /* (SUPC_WUIR Mask) WKUPT */
#define SUPC_WUIR_WKUPT(value)                (SUPC_WUIR_WKUPT_Msk & (_UINT32_(value) << SUPC_WUIR_WKUPT_Pos)) 

/* -------- SUPC_SR : (SUPC Offset: 0x14) ( R/ 32) Status Register -------- */
#define SUPC_SR_TDOSCSEL_Pos                  _UINT32_(0)                                          /* (SUPC_SR) Timing Domain 32 kHz Oscillator Selection Status Position */
#define SUPC_SR_TDOSCSEL_Msk                  (_UINT32_(0x1) << SUPC_SR_TDOSCSEL_Pos)              /* (SUPC_SR) Timing Domain 32 kHz Oscillator Selection Status Mask */
#define SUPC_SR_TDOSCSEL(value)               (SUPC_SR_TDOSCSEL_Msk & (_UINT32_(value) << SUPC_SR_TDOSCSEL_Pos)) /* Assigment of value for TDOSCSEL in the SUPC_SR register */
#define   SUPC_SR_TDOSCSEL_RC_Val             _UINT32_(0x0)                                        /* (SUPC_SR) The timing domain slow clock (TD_SLCK) source is the slow RC oscillator output.  */
#define   SUPC_SR_TDOSCSEL_XTAL_Val           _UINT32_(0x1)                                        /* (SUPC_SR) The timing domain slow clock source is the 32.768 kHz crystal oscillator output.  */
#define SUPC_SR_TDOSCSEL_RC                   (SUPC_SR_TDOSCSEL_RC_Val << SUPC_SR_TDOSCSEL_Pos)    /* (SUPC_SR) The timing domain slow clock (TD_SLCK) source is the slow RC oscillator output. Position  */
#define SUPC_SR_TDOSCSEL_XTAL                 (SUPC_SR_TDOSCSEL_XTAL_Val << SUPC_SR_TDOSCSEL_Pos)  /* (SUPC_SR) The timing domain slow clock source is the 32.768 kHz crystal oscillator output. Position  */
#define SUPC_SR_VDD3V3SMWS_Pos                _UINT32_(2)                                          /* (SUPC_SR) VDD3V3 Supply Monitor Wake-up Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_VDD3V3SMWS_Msk                (_UINT32_(0x1) << SUPC_SR_VDD3V3SMWS_Pos)            /* (SUPC_SR) VDD3V3 Supply Monitor Wake-up Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_VDD3V3SMWS(value)             (SUPC_SR_VDD3V3SMWS_Msk & (_UINT32_(value) << SUPC_SR_VDD3V3SMWS_Pos)) /* Assigment of value for VDD3V3SMWS in the SUPC_SR register */
#define SUPC_SR_CORSMRSTS_Pos                 _UINT32_(3)                                          /* (SUPC_SR) VDDCORE Supply Monitor Reset Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_CORSMRSTS_Msk                 (_UINT32_(0x1) << SUPC_SR_CORSMRSTS_Pos)             /* (SUPC_SR) VDDCORE Supply Monitor Reset Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_CORSMRSTS(value)              (SUPC_SR_CORSMRSTS_Msk & (_UINT32_(value) << SUPC_SR_CORSMRSTS_Pos)) /* Assigment of value for CORSMRSTS in the SUPC_SR register */
#define SUPC_SR_VDD3V3SMRSTS_Pos              _UINT32_(4)                                          /* (SUPC_SR) VDD3V3 Supply Monitor Reset Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_VDD3V3SMRSTS_Msk              (_UINT32_(0x1) << SUPC_SR_VDD3V3SMRSTS_Pos)          /* (SUPC_SR) VDD3V3 Supply Monitor Reset Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_VDD3V3SMRSTS(value)           (SUPC_SR_VDD3V3SMRSTS_Msk & (_UINT32_(value) << SUPC_SR_VDD3V3SMRSTS_Pos)) /* Assigment of value for VDD3V3SMRSTS in the SUPC_SR register */
#define SUPC_SR_VDD3V3SMIS_Pos                _UINT32_(5)                                          /* (SUPC_SR) VDD3V3 Supply Monitor Interrupt Status (cleared by reading SUPC_ISR) Position */
#define SUPC_SR_VDD3V3SMIS_Msk                (_UINT32_(0x1) << SUPC_SR_VDD3V3SMIS_Pos)            /* (SUPC_SR) VDD3V3 Supply Monitor Interrupt Status (cleared by reading SUPC_ISR) Mask */
#define SUPC_SR_VDD3V3SMIS(value)             (SUPC_SR_VDD3V3SMIS_Msk & (_UINT32_(value) << SUPC_SR_VDD3V3SMIS_Pos)) /* Assigment of value for VDD3V3SMIS in the SUPC_SR register */
#define SUPC_SR_VDD3V3SMS_Pos                 _UINT32_(6)                                          /* (SUPC_SR) VDD3V3 Supply Monitor Output Status Position */
#define SUPC_SR_VDD3V3SMS_Msk                 (_UINT32_(0x1) << SUPC_SR_VDD3V3SMS_Pos)             /* (SUPC_SR) VDD3V3 Supply Monitor Output Status Mask */
#define SUPC_SR_VDD3V3SMS(value)              (SUPC_SR_VDD3V3SMS_Msk & (_UINT32_(value) << SUPC_SR_VDD3V3SMS_Pos)) /* Assigment of value for VDD3V3SMS in the SUPC_SR register */
#define SUPC_SR_LCDS_Pos                      _UINT32_(8)                                          /* (SUPC_SR) LCD Power Domain Status Position */
#define SUPC_SR_LCDS_Msk                      (_UINT32_(0x1) << SUPC_SR_LCDS_Pos)                  /* (SUPC_SR) LCD Power Domain Status Mask */
#define SUPC_SR_LCDS(value)                   (SUPC_SR_LCDS_Msk & (_UINT32_(value) << SUPC_SR_LCDS_Pos)) /* Assigment of value for LCDS in the SUPC_SR register */
#define SUPC_SR_FWUPS_Pos                     _UINT32_(12)                                         /* (SUPC_SR) Force Wake-up Pin Status Position */
#define SUPC_SR_FWUPS_Msk                     (_UINT32_(0x1) << SUPC_SR_FWUPS_Pos)                 /* (SUPC_SR) Force Wake-up Pin Status Mask */
#define SUPC_SR_FWUPS(value)                  (SUPC_SR_FWUPS_Msk & (_UINT32_(value) << SUPC_SR_FWUPS_Pos)) /* Assigment of value for FWUPS in the SUPC_SR register */
#define SUPC_SR_LPDBCS0_Pos                   _UINT32_(16)                                         /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Position */
#define SUPC_SR_LPDBCS0_Msk                   (_UINT32_(0x1) << SUPC_SR_LPDBCS0_Pos)               /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Mask */
#define SUPC_SR_LPDBCS0(value)                (SUPC_SR_LPDBCS0_Msk & (_UINT32_(value) << SUPC_SR_LPDBCS0_Pos)) /* Assigment of value for LPDBCS0 in the SUPC_SR register */
#define SUPC_SR_LPDBCS1_Pos                   _UINT32_(17)                                         /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Position */
#define SUPC_SR_LPDBCS1_Msk                   (_UINT32_(0x1) << SUPC_SR_LPDBCS1_Pos)               /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Mask */
#define SUPC_SR_LPDBCS1(value)                (SUPC_SR_LPDBCS1_Msk & (_UINT32_(value) << SUPC_SR_LPDBCS1_Pos)) /* Assigment of value for LPDBCS1 in the SUPC_SR register */
#define SUPC_SR_LPDBCS2_Pos                   _UINT32_(18)                                         /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Position */
#define SUPC_SR_LPDBCS2_Msk                   (_UINT32_(0x1) << SUPC_SR_LPDBCS2_Pos)               /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Mask */
#define SUPC_SR_LPDBCS2(value)                (SUPC_SR_LPDBCS2_Msk & (_UINT32_(value) << SUPC_SR_LPDBCS2_Pos)) /* Assigment of value for LPDBCS2 in the SUPC_SR register */
#define SUPC_SR_LPDBCS3_Pos                   _UINT32_(19)                                         /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Position */
#define SUPC_SR_LPDBCS3_Msk                   (_UINT32_(0x1) << SUPC_SR_LPDBCS3_Pos)               /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Mask */
#define SUPC_SR_LPDBCS3(value)                (SUPC_SR_LPDBCS3_Msk & (_UINT32_(value) << SUPC_SR_LPDBCS3_Pos)) /* Assigment of value for LPDBCS3 in the SUPC_SR register */
#define SUPC_SR_LPDBCS4_Pos                   _UINT32_(20)                                         /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Position */
#define SUPC_SR_LPDBCS4_Msk                   (_UINT32_(0x1) << SUPC_SR_LPDBCS4_Pos)               /* (SUPC_SR) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) Mask */
#define SUPC_SR_LPDBCS4(value)                (SUPC_SR_LPDBCS4_Msk & (_UINT32_(value) << SUPC_SR_LPDBCS4_Pos)) /* Assigment of value for LPDBCS4 in the SUPC_SR register */
#define SUPC_SR_SXFMS_Pos                     _UINT32_(24)                                         /* (SUPC_SR) Slow Crystal Oscillator Frequency Monitor Status (cleared on read) Position */
#define SUPC_SR_SXFMS_Msk                     (_UINT32_(0x3) << SUPC_SR_SXFMS_Pos)                 /* (SUPC_SR) Slow Crystal Oscillator Frequency Monitor Status (cleared on read) Mask */
#define SUPC_SR_SXFMS(value)                  (SUPC_SR_SXFMS_Msk & (_UINT32_(value) << SUPC_SR_SXFMS_Pos)) /* Assigment of value for SXFMS in the SUPC_SR register */
#define   SUPC_SR_SXFMS_GOOD_Val              _UINT32_(0x0)                                        /* (SUPC_SR) No frequency error detected.  */
#define   SUPC_SR_SXFMS_FREQ_ERROR_Val        _UINT32_(0x1)                                        /* (SUPC_SR) The frequency has not been correct over 4 consecutive monitoring periods but there are still edges detected on the slow crystal oscillator output.  */
#define   SUPC_SR_SXFMS_FAIL_Val              _UINT32_(0x2)                                        /* (SUPC_SR) No edge detected in the slow crystal oscillator output for at least 2 consecutive monitoring periods.  */
#define SUPC_SR_SXFMS_GOOD                    (SUPC_SR_SXFMS_GOOD_Val << SUPC_SR_SXFMS_Pos)        /* (SUPC_SR) No frequency error detected. Position  */
#define SUPC_SR_SXFMS_FREQ_ERROR              (SUPC_SR_SXFMS_FREQ_ERROR_Val << SUPC_SR_SXFMS_Pos)  /* (SUPC_SR) The frequency has not been correct over 4 consecutive monitoring periods but there are still edges detected on the slow crystal oscillator output. Position  */
#define SUPC_SR_SXFMS_FAIL                    (SUPC_SR_SXFMS_FAIL_Val << SUPC_SR_SXFMS_Pos)        /* (SUPC_SR) No edge detected in the slow crystal oscillator output for at least 2 consecutive monitoring periods. Position  */
#define SUPC_SR_SXFME_Pos                     _UINT32_(26)                                         /* (SUPC_SR) Slow Crystal Oscillator Frequency Monitor Error (cleared on read) Position */
#define SUPC_SR_SXFME_Msk                     (_UINT32_(0x1) << SUPC_SR_SXFME_Pos)                 /* (SUPC_SR) Slow Crystal Oscillator Frequency Monitor Error (cleared on read) Mask */
#define SUPC_SR_SXFME(value)                  (SUPC_SR_SXFME_Msk & (_UINT32_(value) << SUPC_SR_SXFME_Pos)) /* Assigment of value for SXFME in the SUPC_SR register */
#define SUPC_SR_WKUPS_Pos                     _UINT32_(27)                                         /* (SUPC_SR) WKUP Wake-up Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_WKUPS_Msk                     (_UINT32_(0x1) << SUPC_SR_WKUPS_Pos)                 /* (SUPC_SR) WKUP Wake-up Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_WKUPS(value)                  (SUPC_SR_WKUPS_Msk & (_UINT32_(value) << SUPC_SR_WKUPS_Pos)) /* Assigment of value for WKUPS in the SUPC_SR register */
#define SUPC_SR_BADXTS_Pos                    _UINT32_(28)                                         /* (SUPC_SR) Slow Crystal Oscillator Wake-up Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_BADXTS_Msk                    (_UINT32_(0x1) << SUPC_SR_BADXTS_Pos)                /* (SUPC_SR) Slow Crystal Oscillator Wake-up Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_BADXTS(value)                 (SUPC_SR_BADXTS_Msk & (_UINT32_(value) << SUPC_SR_BADXTS_Pos)) /* Assigment of value for BADXTS in the SUPC_SR register */
#define SUPC_SR_FWKUPS_Pos                    _UINT32_(29)                                         /* (SUPC_SR) FWUP Wake-up Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_FWKUPS_Msk                    (_UINT32_(0x1) << SUPC_SR_FWKUPS_Pos)                /* (SUPC_SR) FWUP Wake-up Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_FWKUPS(value)                 (SUPC_SR_FWKUPS_Msk & (_UINT32_(value) << SUPC_SR_FWKUPS_Pos)) /* Assigment of value for FWKUPS in the SUPC_SR register */
#define SUPC_SR_RTTS_Pos                      _UINT32_(30)                                         /* (SUPC_SR) RTT Wake-up Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_RTTS_Msk                      (_UINT32_(0x1) << SUPC_SR_RTTS_Pos)                  /* (SUPC_SR) RTT Wake-up Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_RTTS(value)                   (SUPC_SR_RTTS_Msk & (_UINT32_(value) << SUPC_SR_RTTS_Pos)) /* Assigment of value for RTTS in the SUPC_SR register */
#define SUPC_SR_RTCS_Pos                      _UINT32_(31)                                         /* (SUPC_SR) RTC Wake-up Status (cleared by reading SUPC_WUSR) Position */
#define SUPC_SR_RTCS_Msk                      (_UINT32_(0x1) << SUPC_SR_RTCS_Pos)                  /* (SUPC_SR) RTC Wake-up Status (cleared by reading SUPC_WUSR) Mask */
#define SUPC_SR_RTCS(value)                   (SUPC_SR_RTCS_Msk & (_UINT32_(value) << SUPC_SR_RTCS_Pos)) /* Assigment of value for RTCS in the SUPC_SR register */
#define SUPC_SR_Msk                           _UINT32_(0xFF1F117D)                                 /* (SUPC_SR) Register Mask  */

#define SUPC_SR_LPDBCS_Pos                    _UINT32_(16)                                         /* (SUPC_SR Position) Tamper Detection Wake-up Status (cleared by reading SUPC_ISR) */
#define SUPC_SR_LPDBCS_Msk                    (_UINT32_(0x1F) << SUPC_SR_LPDBCS_Pos)               /* (SUPC_SR Mask) LPDBCS */
#define SUPC_SR_LPDBCS(value)                 (SUPC_SR_LPDBCS_Msk & (_UINT32_(value) << SUPC_SR_LPDBCS_Pos)) 

