Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_plc_and_go/firmware/src/packs/PIC32CX2051MTG128_DFP/component/supc.h
/* -------- SUPC_EMR : (SUPC Offset: 0x1C) (R/W 32) Extended Mode Register -------- */
#define SUPC_EMR_FLRSGPBR_Pos                 _UINT32_(16)                                         /* (SUPC_EMR) Flash Erase GPBR Position */
#define SUPC_EMR_FLRSGPBR_Msk                 (_UINT32_(0x1) << SUPC_EMR_FLRSGPBR_Pos)             /* (SUPC_EMR) Flash Erase GPBR Mask */
#define SUPC_EMR_FLRSGPBR(value)              (SUPC_EMR_FLRSGPBR_Msk & (_UINT32_(value) << SUPC_EMR_FLRSGPBR_Pos)) /* Assigment of value for FLRSGPBR in the SUPC_EMR register */
#define SUPC_EMR_FULLGPBRC_Pos                _UINT32_(17)                                         /* (SUPC_EMR) Full GPBR Clean Position */
#define SUPC_EMR_FULLGPBRC_Msk                (_UINT32_(0x1) << SUPC_EMR_FULLGPBRC_Pos)            /* (SUPC_EMR) Full GPBR Clean Mask */
#define SUPC_EMR_FULLGPBRC(value)             (SUPC_EMR_FULLGPBRC_Msk & (_UINT32_(value) << SUPC_EMR_FULLGPBRC_Pos)) /* Assigment of value for FULLGPBRC in the SUPC_EMR register */
#define SUPC_EMR_COREBGEN_Pos                 _UINT32_(18)                                         /* (SUPC_EMR) VDDCORE Voltage Regulator Bandgap Enable Position */
#define SUPC_EMR_COREBGEN_Msk                 (_UINT32_(0x1) << SUPC_EMR_COREBGEN_Pos)             /* (SUPC_EMR) VDDCORE Voltage Regulator Bandgap Enable Mask */
#define SUPC_EMR_COREBGEN(value)              (SUPC_EMR_COREBGEN_Msk & (_UINT32_(value) << SUPC_EMR_COREBGEN_Pos)) /* Assigment of value for COREBGEN in the SUPC_EMR register */
#define SUPC_EMR_Msk                          _UINT32_(0x00070000)                                 /* (SUPC_EMR) Register Mask  */


/* -------- SUPC_BMR : (SUPC Offset: 0x20) (R/W 32) Backup Mode Register -------- */
#define SUPC_BMR_RTTWKEN_Pos                  _UINT32_(0)                                          /* (SUPC_BMR) Real-time Timer Wake-up Enable Position */
#define SUPC_BMR_RTTWKEN_Msk                  (_UINT32_(0x1) << SUPC_BMR_RTTWKEN_Pos)              /* (SUPC_BMR) Real-time Timer Wake-up Enable Mask */
#define SUPC_BMR_RTTWKEN(value)               (SUPC_BMR_RTTWKEN_Msk & (_UINT32_(value) << SUPC_BMR_RTTWKEN_Pos)) /* Assigment of value for RTTWKEN in the SUPC_BMR register */
#define   SUPC_BMR_RTTWKEN_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_BMR) The RTT alarm signal has no wake-up effect.  */
#define   SUPC_BMR_RTTWKEN_ENABLE_Val         _UINT32_(0x1)                                        /* (SUPC_BMR) The RTT alarm signal forces the wake-up of the core power supply.  */
#define SUPC_BMR_RTTWKEN_DISABLE              (SUPC_BMR_RTTWKEN_DISABLE_Val << SUPC_BMR_RTTWKEN_Pos) /* (SUPC_BMR) The RTT alarm signal has no wake-up effect. Position  */
#define SUPC_BMR_RTTWKEN_ENABLE               (SUPC_BMR_RTTWKEN_ENABLE_Val << SUPC_BMR_RTTWKEN_Pos) /* (SUPC_BMR) The RTT alarm signal forces the wake-up of the core power supply. Position  */
#define SUPC_BMR_RTCWKEN_Pos                  _UINT32_(1)                                          /* (SUPC_BMR) Real-time Clock Wake-up Enable Position */
#define SUPC_BMR_RTCWKEN_Msk                  (_UINT32_(0x1) << SUPC_BMR_RTCWKEN_Pos)              /* (SUPC_BMR) Real-time Clock Wake-up Enable Mask */
#define SUPC_BMR_RTCWKEN(value)               (SUPC_BMR_RTCWKEN_Msk & (_UINT32_(value) << SUPC_BMR_RTCWKEN_Pos)) /* Assigment of value for RTCWKEN in the SUPC_BMR register */
#define   SUPC_BMR_RTCWKEN_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_BMR) The RTC alarm signal has no wake-up effect.  */
#define   SUPC_BMR_RTCWKEN_ENABLE_Val         _UINT32_(0x1)                                        /* (SUPC_BMR) The RTC alarm signal forces the wake-up of the core power supply.  */
#define SUPC_BMR_RTCWKEN_DISABLE              (SUPC_BMR_RTCWKEN_DISABLE_Val << SUPC_BMR_RTCWKEN_Pos) /* (SUPC_BMR) The RTC alarm signal has no wake-up effect. Position  */
#define SUPC_BMR_RTCWKEN_ENABLE               (SUPC_BMR_RTCWKEN_ENABLE_Val << SUPC_BMR_RTCWKEN_Pos) /* (SUPC_BMR) The RTC alarm signal forces the wake-up of the core power supply. Position  */
#define SUPC_BMR_VBATWKEN_Pos                 _UINT32_(2)                                          /* (SUPC_BMR) VBAT Supply Monitor Wake-up Enable Position */
#define SUPC_BMR_VBATWKEN_Msk                 (_UINT32_(0x1) << SUPC_BMR_VBATWKEN_Pos)             /* (SUPC_BMR) VBAT Supply Monitor Wake-up Enable Mask */
#define SUPC_BMR_VBATWKEN(value)              (SUPC_BMR_VBATWKEN_Msk & (_UINT32_(value) << SUPC_BMR_VBATWKEN_Pos)) /* Assigment of value for VBATWKEN in the SUPC_BMR register */
#define   SUPC_BMR_VBATWKEN_DISABLE_Val       _UINT32_(0x0)                                        /* (SUPC_BMR) Wake-up on VBAT supply monitor under voltage detection is disabled.  */
#define   SUPC_BMR_VBATWKEN_ENABLE_Val        _UINT32_(0x1)                                        /* (SUPC_BMR) Wake-up on VBAT supply monitor under voltage detection is enabled.  */
#define SUPC_BMR_VBATWKEN_DISABLE             (SUPC_BMR_VBATWKEN_DISABLE_Val << SUPC_BMR_VBATWKEN_Pos) /* (SUPC_BMR) Wake-up on VBAT supply monitor under voltage detection is disabled. Position  */
#define SUPC_BMR_VBATWKEN_ENABLE              (SUPC_BMR_VBATWKEN_ENABLE_Val << SUPC_BMR_VBATWKEN_Pos) /* (SUPC_BMR) Wake-up on VBAT supply monitor under voltage detection is enabled. Position  */
#define SUPC_BMR_FWUPEN_Pos                   _UINT32_(4)                                          /* (SUPC_BMR) Force Wake-up Pin Wake-up Enable Position */
#define SUPC_BMR_FWUPEN_Msk                   (_UINT32_(0x1) << SUPC_BMR_FWUPEN_Pos)               /* (SUPC_BMR) Force Wake-up Pin Wake-up Enable Mask */
#define SUPC_BMR_FWUPEN(value)                (SUPC_BMR_FWUPEN_Msk & (_UINT32_(value) << SUPC_BMR_FWUPEN_Pos)) /* Assigment of value for FWUPEN in the SUPC_BMR register */
#define   SUPC_BMR_FWUPEN_DISABLE_Val         _UINT32_(0x0)                                        /* (SUPC_BMR) The fwup signal has no wake-up effect.  */
#define   SUPC_BMR_FWUPEN_ENABLE_Val          _UINT32_(0x1)                                        /* (SUPC_BMR) The fwup signal forces the wake-up of the core power supply.  */
#define SUPC_BMR_FWUPEN_DISABLE               (SUPC_BMR_FWUPEN_DISABLE_Val << SUPC_BMR_FWUPEN_Pos) /* (SUPC_BMR) The fwup signal has no wake-up effect. Position  */
#define SUPC_BMR_FWUPEN_ENABLE                (SUPC_BMR_FWUPEN_ENABLE_Val << SUPC_BMR_FWUPEN_Pos)  /* (SUPC_BMR) The fwup signal forces the wake-up of the core power supply. Position  */
#define SUPC_BMR_CORPORWKEN_Pos               _UINT32_(5)                                          /* (SUPC_BMR) VDDCORE POR Wake-up Enable Position */
#define SUPC_BMR_CORPORWKEN_Msk               (_UINT32_(0x1) << SUPC_BMR_CORPORWKEN_Pos)           /* (SUPC_BMR) VDDCORE POR Wake-up Enable Mask */
#define SUPC_BMR_CORPORWKEN(value)            (SUPC_BMR_CORPORWKEN_Msk & (_UINT32_(value) << SUPC_BMR_CORPORWKEN_Pos)) /* Assigment of value for CORPORWKEN in the SUPC_BMR register */
#define   SUPC_BMR_CORPORWKEN_DISABLE_Val     _UINT32_(0x0)                                        /* (SUPC_BMR) Wake-up on VDDCORE Power-On Reset Event is disabled.  */
#define   SUPC_BMR_CORPORWKEN_ENABLE_Val      _UINT32_(0x1)                                        /* (SUPC_BMR) Wake-up on VDDCORE Power-On Reset Event is enabled.  */
#define SUPC_BMR_CORPORWKEN_DISABLE           (SUPC_BMR_CORPORWKEN_DISABLE_Val << SUPC_BMR_CORPORWKEN_Pos) /* (SUPC_BMR) Wake-up on VDDCORE Power-On Reset Event is disabled. Position  */
#define SUPC_BMR_CORPORWKEN_ENABLE            (SUPC_BMR_CORPORWKEN_ENABLE_Val << SUPC_BMR_CORPORWKEN_Pos) /* (SUPC_BMR) Wake-up on VDDCORE Power-On Reset Event is enabled. Position  */
#define SUPC_BMR_VDD3V3SMWKEN_Pos             _UINT32_(6)                                          /* (SUPC_BMR) VDD3V3 Supply Monitor Wake-up Enable Position */
#define SUPC_BMR_VDD3V3SMWKEN_Msk             (_UINT32_(0x1) << SUPC_BMR_VDD3V3SMWKEN_Pos)         /* (SUPC_BMR) VDD3V3 Supply Monitor Wake-up Enable Mask */
#define SUPC_BMR_VDD3V3SMWKEN(value)          (SUPC_BMR_VDD3V3SMWKEN_Msk & (_UINT32_(value) << SUPC_BMR_VDD3V3SMWKEN_Pos)) /* Assigment of value for VDD3V3SMWKEN in the SUPC_BMR register */
#define   SUPC_BMR_VDD3V3SMWKEN_DISABLE_Val   _UINT32_(0x0)                                        /* (SUPC_BMR) Wake-up on VDD3V3 supply monitor under voltage detection is disabled.  */
#define   SUPC_BMR_VDD3V3SMWKEN_ENABLE_Val    _UINT32_(0x1)                                        /* (SUPC_BMR) Wake-up on VDD3V3 supply monitor under voltage detection is enabled.  */
#define SUPC_BMR_VDD3V3SMWKEN_DISABLE         (SUPC_BMR_VDD3V3SMWKEN_DISABLE_Val << SUPC_BMR_VDD3V3SMWKEN_Pos) /* (SUPC_BMR) Wake-up on VDD3V3 supply monitor under voltage detection is disabled. Position  */
#define SUPC_BMR_VDD3V3SMWKEN_ENABLE          (SUPC_BMR_VDD3V3SMWKEN_ENABLE_Val << SUPC_BMR_VDD3V3SMWKEN_Pos) /* (SUPC_BMR) Wake-up on VDD3V3 supply monitor under voltage detection is enabled. Position  */
#define SUPC_BMR_VBATREN_Pos                  _UINT32_(8)                                          /* (SUPC_BMR) Battery Voltage Event Report Enable Position */
#define SUPC_BMR_VBATREN_Msk                  (_UINT32_(0x1) << SUPC_BMR_VBATREN_Pos)              /* (SUPC_BMR) Battery Voltage Event Report Enable Mask */
#define SUPC_BMR_VBATREN(value)               (SUPC_BMR_VBATREN_Msk & (_UINT32_(value) << SUPC_BMR_VBATREN_Pos)) /* Assigment of value for VBATREN in the SUPC_BMR register */
#define   SUPC_BMR_VBATREN_DISABLE_Val        _UINT32_(0x0)                                        /* (SUPC_BMR) Disables the report of event on VBAT voltage.  */
#define   SUPC_BMR_VBATREN_ENABLE_Val         _UINT32_(0x1)                                        /* (SUPC_BMR) Enables the report of event on VBAT voltage.  */
#define SUPC_BMR_VBATREN_DISABLE              (SUPC_BMR_VBATREN_DISABLE_Val << SUPC_BMR_VBATREN_Pos) /* (SUPC_BMR) Disables the report of event on VBAT voltage. Position  */
#define SUPC_BMR_VBATREN_ENABLE               (SUPC_BMR_VBATREN_ENABLE_Val << SUPC_BMR_VBATREN_Pos) /* (SUPC_BMR) Enables the report of event on VBAT voltage. Position  */
#define SUPC_BMR_MRTCOUT_Pos                  _UINT32_(9)                                          /* (SUPC_BMR) RTCOUT0 Outputs Drive Mode Position */
#define SUPC_BMR_MRTCOUT_Msk                  (_UINT32_(0x1) << SUPC_BMR_MRTCOUT_Pos)              /* (SUPC_BMR) RTCOUT0 Outputs Drive Mode Mask */
#define SUPC_BMR_MRTCOUT(value)               (SUPC_BMR_MRTCOUT_Msk & (_UINT32_(value) << SUPC_BMR_MRTCOUT_Pos)) /* Assigment of value for MRTCOUT in the SUPC_BMR register */
#define   SUPC_BMR_MRTCOUT_USERDEF_Val        _UINT32_(0x0)                                        /* (SUPC_BMR) RTCOUT0 output is driven according to the configuration of the field RTC_MR.OUT0.  */
#define SUPC_BMR_MRTCOUT_USERDEF              (SUPC_BMR_MRTCOUT_USERDEF_Val << SUPC_BMR_MRTCOUT_Pos) /* (SUPC_BMR) RTCOUT0 output is driven according to the configuration of the field RTC_MR.OUT0. Position  */
#define SUPC_BMR_BADXTWKEN_Pos                _UINT32_(10)                                         /* (SUPC_BMR) Slow Crystal Oscillator Frequency Error Wake-up Enable Position */
#define SUPC_BMR_BADXTWKEN_Msk                (_UINT32_(0x1) << SUPC_BMR_BADXTWKEN_Pos)            /* (SUPC_BMR) Slow Crystal Oscillator Frequency Error Wake-up Enable Mask */
#define SUPC_BMR_BADXTWKEN(value)             (SUPC_BMR_BADXTWKEN_Msk & (_UINT32_(value) << SUPC_BMR_BADXTWKEN_Pos)) /* Assigment of value for BADXTWKEN in the SUPC_BMR register */
#define SUPC_BMR_KEY_Pos                      _UINT32_(24)                                         /* (SUPC_BMR) Password Key Position */
#define SUPC_BMR_KEY_Msk                      (_UINT32_(0xFF) << SUPC_BMR_KEY_Pos)                 /* (SUPC_BMR) Password Key Mask */
#define SUPC_BMR_KEY(value)                   (SUPC_BMR_KEY_Msk & (_UINT32_(value) << SUPC_BMR_KEY_Pos)) /* Assigment of value for KEY in the SUPC_BMR register */
#define   SUPC_BMR_KEY_PASSWD_Val             _UINT32_(0xA5)                                       /* (SUPC_BMR) Writing any other value in this field aborts the write operation.  */
#define SUPC_BMR_KEY_PASSWD                   (SUPC_BMR_KEY_PASSWD_Val << SUPC_BMR_KEY_Pos)        /* (SUPC_BMR) Writing any other value in this field aborts the write operation. Position  */
#define SUPC_BMR_Msk                          _UINT32_(0xFF000777)                                 /* (SUPC_BMR) Register Mask  */


