Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_plc_and_go/firmware/src/packs/PIC32CX2051MTG128_DFP/component/supc.h
/* -------- SUPC_WUSR : (SUPC Offset: 0x24) ( R/ 32) Wakeup Status Register -------- */
#define SUPC_WUSR_WKUPS_Pos                   _UINT32_(0)                                          /* (SUPC_WUSR) WKUP Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPS_Msk                   (_UINT32_(0x1) << SUPC_WUSR_WKUPS_Pos)               /* (SUPC_WUSR) WKUP Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPS(value)                (SUPC_WUSR_WKUPS_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPS_Pos)) /* Assigment of value for WKUPS in the SUPC_WUSR register */
#define SUPC_WUSR_BADXTWKS_Pos                _UINT32_(1)                                          /* (SUPC_WUSR) Slow Crystal Oscillator Frequency Error Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_BADXTWKS_Msk                (_UINT32_(0x1) << SUPC_WUSR_BADXTWKS_Pos)            /* (SUPC_WUSR) Slow Crystal Oscillator Frequency Error Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_BADXTWKS(value)             (SUPC_WUSR_BADXTWKS_Msk & (_UINT32_(value) << SUPC_WUSR_BADXTWKS_Pos)) /* Assigment of value for BADXTWKS in the SUPC_WUSR register */
#define SUPC_WUSR_FWUPS_Pos                   _UINT32_(2)                                          /* (SUPC_WUSR) FWUP Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_FWUPS_Msk                   (_UINT32_(0x1) << SUPC_WUSR_FWUPS_Pos)               /* (SUPC_WUSR) FWUP Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_FWUPS(value)                (SUPC_WUSR_FWUPS_Msk & (_UINT32_(value) << SUPC_WUSR_FWUPS_Pos)) /* Assigment of value for FWUPS in the SUPC_WUSR register */
#define SUPC_WUSR_VDD3V3SMWS_Pos              _UINT32_(3)                                          /* (SUPC_WUSR) VDD3V3 Supply Monitor Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_VDD3V3SMWS_Msk              (_UINT32_(0x1) << SUPC_WUSR_VDD3V3SMWS_Pos)          /* (SUPC_WUSR) VDD3V3 Supply Monitor Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_VDD3V3SMWS(value)           (SUPC_WUSR_VDD3V3SMWS_Msk & (_UINT32_(value) << SUPC_WUSR_VDD3V3SMWS_Pos)) /* Assigment of value for VDD3V3SMWS in the SUPC_WUSR register */
#define SUPC_WUSR_RTTS_Pos                    _UINT32_(4)                                          /* (SUPC_WUSR) RTT Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_RTTS_Msk                    (_UINT32_(0x1) << SUPC_WUSR_RTTS_Pos)                /* (SUPC_WUSR) RTT Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_RTTS(value)                 (SUPC_WUSR_RTTS_Msk & (_UINT32_(value) << SUPC_WUSR_RTTS_Pos)) /* Assigment of value for RTTS in the SUPC_WUSR register */
#define SUPC_WUSR_RTCS_Pos                    _UINT32_(5)                                          /* (SUPC_WUSR) RTC Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_RTCS_Msk                    (_UINT32_(0x1) << SUPC_WUSR_RTCS_Pos)                /* (SUPC_WUSR) RTC Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_RTCS(value)                 (SUPC_WUSR_RTCS_Msk & (_UINT32_(value) << SUPC_WUSR_RTCS_Pos)) /* Assigment of value for RTCS in the SUPC_WUSR register */
#define SUPC_WUSR_VDD3V3SMRSTS_Pos            _UINT32_(8)                                          /* (SUPC_WUSR) VDD3V3 Supply Monitor Reset Status (cleared on read) Position */
#define SUPC_WUSR_VDD3V3SMRSTS_Msk            (_UINT32_(0x1) << SUPC_WUSR_VDD3V3SMRSTS_Pos)        /* (SUPC_WUSR) VDD3V3 Supply Monitor Reset Status (cleared on read) Mask */
#define SUPC_WUSR_VDD3V3SMRSTS(value)         (SUPC_WUSR_VDD3V3SMRSTS_Msk & (_UINT32_(value) << SUPC_WUSR_VDD3V3SMRSTS_Pos)) /* Assigment of value for VDD3V3SMRSTS in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS0_Pos                 _UINT32_(16)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS0_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS0_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS0(value)              (SUPC_WUSR_WKUPIS0_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS0_Pos)) /* Assigment of value for WKUPIS0 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS1_Pos                 _UINT32_(17)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS1_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS1_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS1(value)              (SUPC_WUSR_WKUPIS1_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS1_Pos)) /* Assigment of value for WKUPIS1 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS2_Pos                 _UINT32_(18)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS2_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS2_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS2(value)              (SUPC_WUSR_WKUPIS2_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS2_Pos)) /* Assigment of value for WKUPIS2 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS3_Pos                 _UINT32_(19)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS3_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS3_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS3(value)              (SUPC_WUSR_WKUPIS3_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS3_Pos)) /* Assigment of value for WKUPIS3 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS4_Pos                 _UINT32_(20)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS4_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS4_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS4(value)              (SUPC_WUSR_WKUPIS4_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS4_Pos)) /* Assigment of value for WKUPIS4 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS5_Pos                 _UINT32_(21)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS5_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS5_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS5(value)              (SUPC_WUSR_WKUPIS5_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS5_Pos)) /* Assigment of value for WKUPIS5 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS6_Pos                 _UINT32_(22)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS6_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS6_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS6(value)              (SUPC_WUSR_WKUPIS6_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS6_Pos)) /* Assigment of value for WKUPIS6 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS7_Pos                 _UINT32_(23)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS7_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS7_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS7(value)              (SUPC_WUSR_WKUPIS7_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS7_Pos)) /* Assigment of value for WKUPIS7 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS8_Pos                 _UINT32_(24)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS8_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS8_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS8(value)              (SUPC_WUSR_WKUPIS8_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS8_Pos)) /* Assigment of value for WKUPIS8 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS9_Pos                 _UINT32_(25)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS9_Msk                 (_UINT32_(0x1) << SUPC_WUSR_WKUPIS9_Pos)             /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS9(value)              (SUPC_WUSR_WKUPIS9_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS9_Pos)) /* Assigment of value for WKUPIS9 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS10_Pos                _UINT32_(26)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS10_Msk                (_UINT32_(0x1) << SUPC_WUSR_WKUPIS10_Pos)            /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS10(value)             (SUPC_WUSR_WKUPIS10_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS10_Pos)) /* Assigment of value for WKUPIS10 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS11_Pos                _UINT32_(27)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS11_Msk                (_UINT32_(0x1) << SUPC_WUSR_WKUPIS11_Pos)            /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS11(value)             (SUPC_WUSR_WKUPIS11_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS11_Pos)) /* Assigment of value for WKUPIS11 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS12_Pos                _UINT32_(28)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS12_Msk                (_UINT32_(0x1) << SUPC_WUSR_WKUPIS12_Pos)            /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS12(value)             (SUPC_WUSR_WKUPIS12_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS12_Pos)) /* Assigment of value for WKUPIS12 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS13_Pos                _UINT32_(29)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS13_Msk                (_UINT32_(0x1) << SUPC_WUSR_WKUPIS13_Pos)            /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS13(value)             (SUPC_WUSR_WKUPIS13_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS13_Pos)) /* Assigment of value for WKUPIS13 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS14_Pos                _UINT32_(30)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS14_Msk                (_UINT32_(0x1) << SUPC_WUSR_WKUPIS14_Pos)            /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS14(value)             (SUPC_WUSR_WKUPIS14_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS14_Pos)) /* Assigment of value for WKUPIS14 in the SUPC_WUSR register */
#define SUPC_WUSR_WKUPIS15_Pos                _UINT32_(31)                                         /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Position */
#define SUPC_WUSR_WKUPIS15_Msk                (_UINT32_(0x1) << SUPC_WUSR_WKUPIS15_Pos)            /* (SUPC_WUSR) WKUPx Input Wake-up Status (cleared on read) Mask */
#define SUPC_WUSR_WKUPIS15(value)             (SUPC_WUSR_WKUPIS15_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS15_Pos)) /* Assigment of value for WKUPIS15 in the SUPC_WUSR register */
#define SUPC_WUSR_Msk                         _UINT32_(0xFFFF013F)                                 /* (SUPC_WUSR) Register Mask  */

#define SUPC_WUSR_WKUPIS_Pos                  _UINT32_(16)                                         /* (SUPC_WUSR Position) WKUPx Input Wake-up Status (cleared on read) */
#define SUPC_WUSR_WKUPIS_Msk                  (_UINT32_(0xFFFF) << SUPC_WUSR_WKUPIS_Pos)           /* (SUPC_WUSR Mask) WKUPIS */
#define SUPC_WUSR_WKUPIS(value)               (SUPC_WUSR_WKUPIS_Msk & (_UINT32_(value) << SUPC_WUSR_WKUPIS_Pos)) 

/* -------- SUPC_IER : (SUPC Offset: 0x28) ( /W 32) Enable Interrupt Register -------- */
#define SUPC_IER_LPDBC0_Pos                   _UINT32_(0)                                          /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Position */
#define SUPC_IER_LPDBC0_Msk                   (_UINT32_(0x1) << SUPC_IER_LPDBC0_Pos)               /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Mask */
#define SUPC_IER_LPDBC0(value)                (SUPC_IER_LPDBC0_Msk & (_UINT32_(value) << SUPC_IER_LPDBC0_Pos)) /* Assigment of value for LPDBC0 in the SUPC_IER register */
#define SUPC_IER_LPDBC1_Pos                   _UINT32_(1)                                          /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Position */
#define SUPC_IER_LPDBC1_Msk                   (_UINT32_(0x1) << SUPC_IER_LPDBC1_Pos)               /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Mask */
#define SUPC_IER_LPDBC1(value)                (SUPC_IER_LPDBC1_Msk & (_UINT32_(value) << SUPC_IER_LPDBC1_Pos)) /* Assigment of value for LPDBC1 in the SUPC_IER register */
#define SUPC_IER_LPDBC2_Pos                   _UINT32_(2)                                          /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Position */
#define SUPC_IER_LPDBC2_Msk                   (_UINT32_(0x1) << SUPC_IER_LPDBC2_Pos)               /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Mask */
#define SUPC_IER_LPDBC2(value)                (SUPC_IER_LPDBC2_Msk & (_UINT32_(value) << SUPC_IER_LPDBC2_Pos)) /* Assigment of value for LPDBC2 in the SUPC_IER register */
#define SUPC_IER_LPDBC3_Pos                   _UINT32_(3)                                          /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Position */
#define SUPC_IER_LPDBC3_Msk                   (_UINT32_(0x1) << SUPC_IER_LPDBC3_Pos)               /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Mask */
#define SUPC_IER_LPDBC3(value)                (SUPC_IER_LPDBC3_Msk & (_UINT32_(value) << SUPC_IER_LPDBC3_Pos)) /* Assigment of value for LPDBC3 in the SUPC_IER register */
#define SUPC_IER_LPDBC4_Pos                   _UINT32_(4)                                          /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Position */
#define SUPC_IER_LPDBC4_Msk                   (_UINT32_(0x1) << SUPC_IER_LPDBC4_Pos)               /* (SUPC_IER) WKUPx Pin Tamper Detection Interrupt Enable Mask */
#define SUPC_IER_LPDBC4(value)                (SUPC_IER_LPDBC4_Msk & (_UINT32_(value) << SUPC_IER_LPDBC4_Pos)) /* Assigment of value for LPDBC4 in the SUPC_IER register */
#define SUPC_IER_VDD3V3SMEV_Pos               _UINT32_(16)                                         /* (SUPC_IER) VDD3V3 Supply Monitor Event Interrupt Enable Position */
#define SUPC_IER_VDD3V3SMEV_Msk               (_UINT32_(0x1) << SUPC_IER_VDD3V3SMEV_Pos)           /* (SUPC_IER) VDD3V3 Supply Monitor Event Interrupt Enable Mask */
#define SUPC_IER_VDD3V3SMEV(value)            (SUPC_IER_VDD3V3SMEV_Msk & (_UINT32_(value) << SUPC_IER_VDD3V3SMEV_Pos)) /* Assigment of value for VDD3V3SMEV in the SUPC_IER register */
#define SUPC_IER_VBATSMEV_Pos                 _UINT32_(17)                                         /* (SUPC_IER) VBAT Supply Monitor Event Interrupt Enable Position */
#define SUPC_IER_VBATSMEV_Msk                 (_UINT32_(0x1) << SUPC_IER_VBATSMEV_Pos)             /* (SUPC_IER) VBAT Supply Monitor Event Interrupt Enable Mask */
#define SUPC_IER_VBATSMEV(value)              (SUPC_IER_VBATSMEV_Msk & (_UINT32_(value) << SUPC_IER_VBATSMEV_Pos)) /* Assigment of value for VBATSMEV in the SUPC_IER register */
#define SUPC_IER_Msk                          _UINT32_(0x0003001F)                                 /* (SUPC_IER) Register Mask  */

#define SUPC_IER_LPDBC_Pos                    _UINT32_(0)                                          /* (SUPC_IER Position) WKUPx Pin Tamper Detection Interrupt Enable */
#define SUPC_IER_LPDBC_Msk                    (_UINT32_(0x1F) << SUPC_IER_LPDBC_Pos)               /* (SUPC_IER Mask) LPDBC */
#define SUPC_IER_LPDBC(value)                 (SUPC_IER_LPDBC_Msk & (_UINT32_(value) << SUPC_IER_LPDBC_Pos)) 

