Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_plc_and_go/firmware/src/packs/PIC32CX2051MTG128_DFP/component/supc.h
/* -------- SUPC_IDR : (SUPC Offset: 0x2C) ( /W 32) Disable Interrupt Register -------- */
#define SUPC_IDR_LPDBC0_Pos                   _UINT32_(0)                                          /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Position */
#define SUPC_IDR_LPDBC0_Msk                   (_UINT32_(0x1) << SUPC_IDR_LPDBC0_Pos)               /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Mask */
#define SUPC_IDR_LPDBC0(value)                (SUPC_IDR_LPDBC0_Msk & (_UINT32_(value) << SUPC_IDR_LPDBC0_Pos)) /* Assigment of value for LPDBC0 in the SUPC_IDR register */
#define SUPC_IDR_LPDBC1_Pos                   _UINT32_(1)                                          /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Position */
#define SUPC_IDR_LPDBC1_Msk                   (_UINT32_(0x1) << SUPC_IDR_LPDBC1_Pos)               /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Mask */
#define SUPC_IDR_LPDBC1(value)                (SUPC_IDR_LPDBC1_Msk & (_UINT32_(value) << SUPC_IDR_LPDBC1_Pos)) /* Assigment of value for LPDBC1 in the SUPC_IDR register */
#define SUPC_IDR_LPDBC2_Pos                   _UINT32_(2)                                          /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Position */
#define SUPC_IDR_LPDBC2_Msk                   (_UINT32_(0x1) << SUPC_IDR_LPDBC2_Pos)               /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Mask */
#define SUPC_IDR_LPDBC2(value)                (SUPC_IDR_LPDBC2_Msk & (_UINT32_(value) << SUPC_IDR_LPDBC2_Pos)) /* Assigment of value for LPDBC2 in the SUPC_IDR register */
#define SUPC_IDR_LPDBC3_Pos                   _UINT32_(3)                                          /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Position */
#define SUPC_IDR_LPDBC3_Msk                   (_UINT32_(0x1) << SUPC_IDR_LPDBC3_Pos)               /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Mask */
#define SUPC_IDR_LPDBC3(value)                (SUPC_IDR_LPDBC3_Msk & (_UINT32_(value) << SUPC_IDR_LPDBC3_Pos)) /* Assigment of value for LPDBC3 in the SUPC_IDR register */
#define SUPC_IDR_LPDBC4_Pos                   _UINT32_(4)                                          /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Position */
#define SUPC_IDR_LPDBC4_Msk                   (_UINT32_(0x1) << SUPC_IDR_LPDBC4_Pos)               /* (SUPC_IDR) WKUPx Pin Tamper Detection Interrupt Disable Mask */
#define SUPC_IDR_LPDBC4(value)                (SUPC_IDR_LPDBC4_Msk & (_UINT32_(value) << SUPC_IDR_LPDBC4_Pos)) /* Assigment of value for LPDBC4 in the SUPC_IDR register */
#define SUPC_IDR_VDD3V3SMEV_Pos               _UINT32_(16)                                         /* (SUPC_IDR) VDD3V3 Supply Monitor Event Interrupt Disable Position */
#define SUPC_IDR_VDD3V3SMEV_Msk               (_UINT32_(0x1) << SUPC_IDR_VDD3V3SMEV_Pos)           /* (SUPC_IDR) VDD3V3 Supply Monitor Event Interrupt Disable Mask */
#define SUPC_IDR_VDD3V3SMEV(value)            (SUPC_IDR_VDD3V3SMEV_Msk & (_UINT32_(value) << SUPC_IDR_VDD3V3SMEV_Pos)) /* Assigment of value for VDD3V3SMEV in the SUPC_IDR register */
#define SUPC_IDR_VBATSMEV_Pos                 _UINT32_(17)                                         /* (SUPC_IDR) VBAT Supply Monitor Event Interrupt Disable Position */
#define SUPC_IDR_VBATSMEV_Msk                 (_UINT32_(0x1) << SUPC_IDR_VBATSMEV_Pos)             /* (SUPC_IDR) VBAT Supply Monitor Event Interrupt Disable Mask */
#define SUPC_IDR_VBATSMEV(value)              (SUPC_IDR_VBATSMEV_Msk & (_UINT32_(value) << SUPC_IDR_VBATSMEV_Pos)) /* Assigment of value for VBATSMEV in the SUPC_IDR register */
#define SUPC_IDR_Msk                          _UINT32_(0x0003001F)                                 /* (SUPC_IDR) Register Mask  */

#define SUPC_IDR_LPDBC_Pos                    _UINT32_(0)                                          /* (SUPC_IDR Position) WKUPx Pin Tamper Detection Interrupt Disable */
#define SUPC_IDR_LPDBC_Msk                    (_UINT32_(0x1F) << SUPC_IDR_LPDBC_Pos)               /* (SUPC_IDR Mask) LPDBC */
#define SUPC_IDR_LPDBC(value)                 (SUPC_IDR_LPDBC_Msk & (_UINT32_(value) << SUPC_IDR_LPDBC_Pos)) 

/* -------- SUPC_IMR : (SUPC Offset: 0x30) ( R/ 32) Mask Interrupt Register -------- */
#define SUPC_IMR_LPDBC0_Pos                   _UINT32_(0)                                          /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Position */
#define SUPC_IMR_LPDBC0_Msk                   (_UINT32_(0x1) << SUPC_IMR_LPDBC0_Pos)               /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Mask */
#define SUPC_IMR_LPDBC0(value)                (SUPC_IMR_LPDBC0_Msk & (_UINT32_(value) << SUPC_IMR_LPDBC0_Pos)) /* Assigment of value for LPDBC0 in the SUPC_IMR register */
#define SUPC_IMR_LPDBC1_Pos                   _UINT32_(1)                                          /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Position */
#define SUPC_IMR_LPDBC1_Msk                   (_UINT32_(0x1) << SUPC_IMR_LPDBC1_Pos)               /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Mask */
#define SUPC_IMR_LPDBC1(value)                (SUPC_IMR_LPDBC1_Msk & (_UINT32_(value) << SUPC_IMR_LPDBC1_Pos)) /* Assigment of value for LPDBC1 in the SUPC_IMR register */
#define SUPC_IMR_LPDBC2_Pos                   _UINT32_(2)                                          /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Position */
#define SUPC_IMR_LPDBC2_Msk                   (_UINT32_(0x1) << SUPC_IMR_LPDBC2_Pos)               /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Mask */
#define SUPC_IMR_LPDBC2(value)                (SUPC_IMR_LPDBC2_Msk & (_UINT32_(value) << SUPC_IMR_LPDBC2_Pos)) /* Assigment of value for LPDBC2 in the SUPC_IMR register */
#define SUPC_IMR_LPDBC3_Pos                   _UINT32_(3)                                          /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Position */
#define SUPC_IMR_LPDBC3_Msk                   (_UINT32_(0x1) << SUPC_IMR_LPDBC3_Pos)               /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Mask */
#define SUPC_IMR_LPDBC3(value)                (SUPC_IMR_LPDBC3_Msk & (_UINT32_(value) << SUPC_IMR_LPDBC3_Pos)) /* Assigment of value for LPDBC3 in the SUPC_IMR register */
#define SUPC_IMR_LPDBC4_Pos                   _UINT32_(4)                                          /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Position */
#define SUPC_IMR_LPDBC4_Msk                   (_UINT32_(0x1) << SUPC_IMR_LPDBC4_Pos)               /* (SUPC_IMR) WKUPx Pin Tamper Detection Interrupt Mask Mask */
#define SUPC_IMR_LPDBC4(value)                (SUPC_IMR_LPDBC4_Msk & (_UINT32_(value) << SUPC_IMR_LPDBC4_Pos)) /* Assigment of value for LPDBC4 in the SUPC_IMR register */
#define SUPC_IMR_VDD3V3SMEV_Pos               _UINT32_(16)                                         /* (SUPC_IMR) VDD3V3 Supply Monitor Event Interrupt Mask Position */
#define SUPC_IMR_VDD3V3SMEV_Msk               (_UINT32_(0x1) << SUPC_IMR_VDD3V3SMEV_Pos)           /* (SUPC_IMR) VDD3V3 Supply Monitor Event Interrupt Mask Mask */
#define SUPC_IMR_VDD3V3SMEV(value)            (SUPC_IMR_VDD3V3SMEV_Msk & (_UINT32_(value) << SUPC_IMR_VDD3V3SMEV_Pos)) /* Assigment of value for VDD3V3SMEV in the SUPC_IMR register */
#define SUPC_IMR_VBATSMEV_Pos                 _UINT32_(17)                                         /* (SUPC_IMR) VBAT Supply Monitor Event Interrupt Mask Position */
#define SUPC_IMR_VBATSMEV_Msk                 (_UINT32_(0x1) << SUPC_IMR_VBATSMEV_Pos)             /* (SUPC_IMR) VBAT Supply Monitor Event Interrupt Mask Mask */
#define SUPC_IMR_VBATSMEV(value)              (SUPC_IMR_VBATSMEV_Msk & (_UINT32_(value) << SUPC_IMR_VBATSMEV_Pos)) /* Assigment of value for VBATSMEV in the SUPC_IMR register */
#define SUPC_IMR_Msk                          _UINT32_(0x0003001F)                                 /* (SUPC_IMR) Register Mask  */

#define SUPC_IMR_LPDBC_Pos                    _UINT32_(0)                                          /* (SUPC_IMR Position) WKUPx Pin Tamper Detection Interrupt Mask */
#define SUPC_IMR_LPDBC_Msk                    (_UINT32_(0x1F) << SUPC_IMR_LPDBC_Pos)               /* (SUPC_IMR Mask) LPDBC */
#define SUPC_IMR_LPDBC(value)                 (SUPC_IMR_LPDBC_Msk & (_UINT32_(value) << SUPC_IMR_LPDBC_Pos)) 

/* -------- SUPC_ISR : (SUPC Offset: 0x34) ( R/ 32) Status Interrupt Register -------- */
#define SUPC_ISR_LPDBC0_Pos                   _UINT32_(0)                                          /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Position */
#define SUPC_ISR_LPDBC0_Msk                   (_UINT32_(0x1) << SUPC_ISR_LPDBC0_Pos)               /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Mask */
#define SUPC_ISR_LPDBC0(value)                (SUPC_ISR_LPDBC0_Msk & (_UINT32_(value) << SUPC_ISR_LPDBC0_Pos)) /* Assigment of value for LPDBC0 in the SUPC_ISR register */
#define SUPC_ISR_LPDBC1_Pos                   _UINT32_(1)                                          /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Position */
#define SUPC_ISR_LPDBC1_Msk                   (_UINT32_(0x1) << SUPC_ISR_LPDBC1_Pos)               /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Mask */
#define SUPC_ISR_LPDBC1(value)                (SUPC_ISR_LPDBC1_Msk & (_UINT32_(value) << SUPC_ISR_LPDBC1_Pos)) /* Assigment of value for LPDBC1 in the SUPC_ISR register */
#define SUPC_ISR_LPDBC2_Pos                   _UINT32_(2)                                          /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Position */
#define SUPC_ISR_LPDBC2_Msk                   (_UINT32_(0x1) << SUPC_ISR_LPDBC2_Pos)               /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Mask */
#define SUPC_ISR_LPDBC2(value)                (SUPC_ISR_LPDBC2_Msk & (_UINT32_(value) << SUPC_ISR_LPDBC2_Pos)) /* Assigment of value for LPDBC2 in the SUPC_ISR register */
#define SUPC_ISR_LPDBC3_Pos                   _UINT32_(3)                                          /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Position */
#define SUPC_ISR_LPDBC3_Msk                   (_UINT32_(0x1) << SUPC_ISR_LPDBC3_Pos)               /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Mask */
#define SUPC_ISR_LPDBC3(value)                (SUPC_ISR_LPDBC3_Msk & (_UINT32_(value) << SUPC_ISR_LPDBC3_Pos)) /* Assigment of value for LPDBC3 in the SUPC_ISR register */
#define SUPC_ISR_LPDBC4_Pos                   _UINT32_(4)                                          /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Position */
#define SUPC_ISR_LPDBC4_Msk                   (_UINT32_(0x1) << SUPC_ISR_LPDBC4_Pos)               /* (SUPC_ISR) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) Mask */
#define SUPC_ISR_LPDBC4(value)                (SUPC_ISR_LPDBC4_Msk & (_UINT32_(value) << SUPC_ISR_LPDBC4_Pos)) /* Assigment of value for LPDBC4 in the SUPC_ISR register */
#define SUPC_ISR_VDD3V3SMEV_Pos               _UINT32_(16)                                         /* (SUPC_ISR) VDD3V3 Supply Monitor Event Interrupt Status (cleared on read) Position */
#define SUPC_ISR_VDD3V3SMEV_Msk               (_UINT32_(0x1) << SUPC_ISR_VDD3V3SMEV_Pos)           /* (SUPC_ISR) VDD3V3 Supply Monitor Event Interrupt Status (cleared on read) Mask */
#define SUPC_ISR_VDD3V3SMEV(value)            (SUPC_ISR_VDD3V3SMEV_Msk & (_UINT32_(value) << SUPC_ISR_VDD3V3SMEV_Pos)) /* Assigment of value for VDD3V3SMEV in the SUPC_ISR register */
#define SUPC_ISR_VBATSMEV_Pos                 _UINT32_(17)                                         /* (SUPC_ISR) VBAT Supply Monitor Event Interrupt Status (cleared on read) Position */
#define SUPC_ISR_VBATSMEV_Msk                 (_UINT32_(0x1) << SUPC_ISR_VBATSMEV_Pos)             /* (SUPC_ISR) VBAT Supply Monitor Event Interrupt Status (cleared on read) Mask */
#define SUPC_ISR_VBATSMEV(value)              (SUPC_ISR_VBATSMEV_Msk & (_UINT32_(value) << SUPC_ISR_VBATSMEV_Pos)) /* Assigment of value for VBATSMEV in the SUPC_ISR register */
#define SUPC_ISR_Msk                          _UINT32_(0x0003001F)                                 /* (SUPC_ISR) Register Mask  */

#define SUPC_ISR_LPDBC_Pos                    _UINT32_(0)                                          /* (SUPC_ISR Position) WKUPx Pin Tamper Detection Interrupt Status (cleared on read) */
#define SUPC_ISR_LPDBC_Msk                    (_UINT32_(0x1F) << SUPC_ISR_LPDBC_Pos)               /* (SUPC_ISR Mask) LPDBC */
#define SUPC_ISR_LPDBC(value)                 (SUPC_ISR_LPDBC_Msk & (_UINT32_(value) << SUPC_ISR_LPDBC_Pos)) 

/** \brief SUPC register offsets definitions */
#define SUPC_CR_REG_OFST               _UINT32_(0x00)      /* (SUPC_CR) Control Register Offset */
#define SUPC_SMMR_REG_OFST             _UINT32_(0x04)      /* (SUPC_SMMR) Supply Monitor Mode Register Offset */
#define SUPC_MR_REG_OFST               _UINT32_(0x08)      /* (SUPC_MR) Mode Register Offset */
#define SUPC_WUMR_REG_OFST             _UINT32_(0x0C)      /* (SUPC_WUMR) Wakeup Mode Register Offset */
#define SUPC_WUIR_REG_OFST             _UINT32_(0x10)      /* (SUPC_WUIR) Wakeup Inputs Register Offset */
#define SUPC_SR_REG_OFST               _UINT32_(0x14)      /* (SUPC_SR) Status Register Offset */
#define SUPC_EMR_REG_OFST              _UINT32_(0x1C)      /* (SUPC_EMR) Extended Mode Register Offset */
#define SUPC_BMR_REG_OFST              _UINT32_(0x20)      /* (SUPC_BMR) Backup Mode Register Offset */
#define SUPC_WUSR_REG_OFST             _UINT32_(0x24)      /* (SUPC_WUSR) Wakeup Status Register Offset */
#define SUPC_IER_REG_OFST              _UINT32_(0x28)      /* (SUPC_IER) Enable Interrupt Register Offset */
#define SUPC_IDR_REG_OFST              _UINT32_(0x2C)      /* (SUPC_IDR) Disable Interrupt Register Offset */
#define SUPC_IMR_REG_OFST              _UINT32_(0x30)      /* (SUPC_IMR) Mask Interrupt Register Offset */
#define SUPC_ISR_REG_OFST              _UINT32_(0x34)      /* (SUPC_ISR) Status Interrupt Register Offset */

